In [5]:
import pandas as pd
from pandas_datareader import data as pdr
import yfinance as yf
yf.pdr_override()

In [13]:
tickers = ["CASH3.SA", 'VALE3.SA']
dados_acao = pdr.get_data_yahoo(tickers, start = '2015-01-01', end = '2022-12-31')['Adj Close']
dados_acao

[*********************100%***********************]  2 of 2 completed

            CASH3.SA   VALE3.SA
Date
2015-01-02       NaN  13.397045
2015-01-05       NaN  13.195587
2015-01-06       NaN  13.724416
2015-01-07       NaN  14.228066
2015-01-08       NaN  14.379161
...              ...        ...
2022-12-23      1.26  86.320000
2022-12-26      1.25  87.110001
2022-12-27      1.17  89.190002
2022-12-28      1.19  88.989998
2022-12-29      1.18  88.879997

[1988 rows x 2 columns]

In [14]:
dados_teste = pd.DataFrame({
    'empresa': ['Weg','Petrobras','Vale', pd.NA],
    'cotacao': [20, 50, pd.NA, pd.NA],
    'volume': [3000, pd.NA, pd.NA, pd.NA]
})
dados_teste

     empresa cotacao volume
0        Weg      20   3000
1  Petrobras      50   <NA>
2       Vale    <NA>   <NA>
3       <NA>    <NA>   <NA>

In [16]:
# Tirando dados ausentes
dados_acao = dados_acao.dropna()
dados_acao

            CASH3.SA   VALE3.SA
Date
2020-11-09  1.579895  49.010887
2020-11-10  1.631504  48.987617
2020-11-11  1.639828  49.328888
2020-11-12  1.589884  48.607571
2020-11-13  1.623181  49.057423
...              ...        ...
2022-12-23  1.260000  86.320000
2022-12-26  1.250000  87.110001
2022-12-27  1.170000  89.190002
2022-12-28  1.190000  88.989998
2022-12-29  1.180000  88.879997

[532 rows x 2 columns]

In [18]:
# Qualquer dados ausentes

print(dados_teste.dropna())

#todas as colunas tem que ser NA
print(dados_teste.dropna(how = 'all'))

#duas colunas como NA

print(dados_teste.dropna(subset = ['empresa', 'cotacao']))

  empresa cotacao volume
0     Weg      20   3000
     empresa cotacao volume
0        Weg      20   3000
1  Petrobras      50   <NA>
2       Vale    <NA>   <NA>
     empresa cotacao volume
0        Weg      20   3000
1  Petrobras      50   <NA>

In [19]:
# Preenchendo dados ausentes

print(dados_teste.fillna(0))

dados_teste.fillna({'empresa': 'Nenhuma',
                   'cotacao': 0,
                   'volume': -10})

     empresa  cotacao  volume
0        Weg       20    3000
1  Petrobras       50       0
2       Vale        0       0
3          0        0       0

     empresa  cotacao  volume
0        Weg       20    3000
1  Petrobras       50     -10
2       Vale        0     -10
3    Nenhuma        0     -10

In [20]:
cotacoes = pd.Series([20, pd.NA, pd.NA, pd.NA, 23, 24, pd.NA, 25],
                    index = pd.date_range('30/06/2022', freq = 'M', periods = 8))

cotacoes

C:\Users\Pichau\AppData\Local\Temp\ipykernel_14324\3481745678.py:2: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  index = pd.date_range('30/06/2022', freq = 'M', periods = 8))

2022-06-30      20
2022-07-31    <NA>
2022-08-31    <NA>
2022-09-30    <NA>
2022-10-31      23
2022-11-30      24
2022-12-31    <NA>
2023-01-31      25
Freq: M, dtype: object

In [21]:
cotacoes.fillna(method = 'ffill')

2022-06-30    20
2022-07-31    20
2022-08-31    20
2022-09-30    20
2022-10-31    23
2022-11-30    24
2022-12-31    24
2023-01-31    25
Freq: M, dtype: int64

In [22]:
cotacoes.fillna(method = 'ffill', limit = 2)

2022-06-30      20
2022-07-31      20
2022-08-31      20
2022-09-30    <NA>
2022-10-31      23
2022-11-30      24
2022-12-31      24
2023-01-31      25
Freq: M, dtype: object

In [23]:
cotacoes.fillna(cotacoes.mean())

2022-06-30    20.0
2022-07-31    23.0
2022-08-31    23.0
2022-09-30    23.0
2022-10-31    23.0
2022-11-30    24.0
2022-12-31    23.0
2023-01-31    25.0
Freq: M, dtype: float64

# Exercícios
- Exercício 64: Puxe dados de cotação ajustadas das empresas PETR4.SA, LJQQ3.SA e CASH3.SA desde 2015. Crie um dataframe que não possua nenhum dado faltante em nenhuma coluna e,  em seguida um dataframe que filtre NA na coluna LJQQ3 mas aceite NA em CASH3.
- Exercício 65: Leia a planilha Mundo16dados_euca3.xlsx na pasta dados com as cotações reais de EUCA3 desde 25/05/2022 até 22/09/2022. Preencha as cotações faltantes com o métodos ffill limitado a dois dias de preenchimento.

In [34]:
# Exercício 64

from datetime import datetime
tickers = ['PETR4.SA', 'LJQQ3.SA', 'CASH3.SA']
df = pdr.get_data_yahoo(tickers, start = '2015-01-01', end = datetime.now())['Adj Close']
df_sem_na = df.dropna()
print(df_sem_na)

df_sem_na_ljqq3 = df.dropna(subset = 'LJQQ3.SA')
df_sem_na_ljqq3

[*********************100%***********************]  3 of 3 completed
            CASH3.SA   LJQQ3.SA   PETR4.SA
Date
2020-11-09  1.579895  14.748902  10.264723
2020-11-10  1.631504  14.011457  10.962970
2020-11-11  1.639828  14.650577  10.867970
2020-11-12  1.589884  14.208110  10.407223
2020-11-13  1.623181  14.660410  10.749219
...              ...        ...        ...
2023-01-04  1.120000   3.940000  23.049999
2023-01-05  1.140000   4.060000  23.879999
2023-01-06  1.150000   4.200000  23.740000
2023-01-09  1.150000   4.150000  23.870001
2023-01-10  1.160000   4.260000  23.540001

[539 rows x 3 columns]

            CASH3.SA   LJQQ3.SA   PETR4.SA
Date
2020-08-10       NaN  12.575898  11.138721
2020-08-11       NaN  12.536568  10.962970
2020-08-12       NaN  12.438241  11.152969
2020-08-13       NaN  12.684056  10.848971
2020-08-14       NaN  13.274013  10.768221
...              ...        ...        ...
2023-01-04      1.12   3.940000  23.049999
2023-01-05      1.14   4.060000  23.879999
2023-01-06      1.15   4.200000  23.740000
2023-01-09      1.15   4.150000  23.870001
2023-01-10      1.16   4.260000  23.540001

[601 rows x 3 columns]

In [43]:
# Exercício 65
df = pd.read_excel('dados\Mundo16dados_euca3.xlsx', na_values = 'nd')
df_tratado = df.fillna(method = 'ffill', limit = 2)
print(df_tratado)

         Data  EUCA3
0  2022-09-22    NaN
1  2022-09-21  12.50
2  2022-09-20  12.78
3  2022-09-19  12.78
4  2022-09-16  12.78
..        ...    ...
80 2022-05-31  15.64
81 2022-05-30  15.68
82 2022-05-27  15.77
83 2022-05-26  15.43
84 2022-05-25  15.28

[85 rows x 2 columns]